#Дано дійсні числа:  . З’ясувати, чи належать ці числа інтервалу
a = float(input('a ='))
b = float(input('b ='))
c = float(input('c ='))
d = float(input('d ='))
if 1 <= a <= 2 or c < a < d:
    print('Число а належить інтервалу')
if 1 <= b <= 2 or c < b < d:
    print('Число b належить інтервалу')
if 1 <= c <= 2:
    print('Число c належить інтервалу')
if 1 <= d <= 2:
    print('Число d належить інтервалу')

