#Трикутник задається координатами своїх вершин на площині:  . Визначити, чи є цей трикутник прямокутним.
x1 = float(input('x1 = '))
y1 = float(input('y1 = '))
x2 = float(input('x2 = '))
y2 = float(input('y2 = '))
x3 = float(input('x3 = '))
y3 = float(input('y3 = '))
x1_y1 = (x1**2+y1**2)**(1/2)
x2_y2 = (x2**2+y2**2)**(1/2)
x3_y3 = (x3**2+y3**2)**(1/2)
if x1_y1 ** 2 + x2_y2 ** 2 == x3_y3 ** 2:
    print('Трикутник прямокутний')
elif x1_y1 ** 2 + x3_y3 ** 2 == x2_y2 ** 2:
    print('Трикутник прямокутний')
elif x2_y2 ** 2 + x3_y3 ** 2 == x1_y1 ** 2:
    print('Трикутник прямокутний')
else:
    print('Трикутник не прямокутний')
